cptzs/MSPM0G3507_ModelVehicleControl/main.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "MSPM0G350X" --part "Default" --package "LQFP-64(PM)" --product "mspm0_sdk@2.05.01.00"
 * @v2CliArgs --device "MSPM0G3507" --package "LQFP-64(PM)" --product "mspm0_sdk@2.05.01.00"
 * @versions {"tool":"1.24.1+4189"}
 */

/**
 * Import the modules used in this configuration.
 */
const ADC12         = scripting.addModule("/ti/driverlib/ADC12", {}, false);
const ADC121        = ADC12.addInstance();
const COMPARE       = scripting.addModule("/ti/driverlib/COMPARE", {}, false);
const COMPARE1      = COMPARE.addInstance();
const COMPARE2      = COMPARE.addInstance();
const COMPARE3      = COMPARE.addInstance();
const GPIO          = scripting.addModule("/ti/driverlib/GPIO", {}, false);
const GPIO1         = GPIO.addInstance();
const GPIO2         = GPIO.addInstance();
const GPIO3         = GPIO.addInstance();
const GPIO4         = GPIO.addInstance();
const GPIO5         = GPIO.addInstance();
const GPIO6         = GPIO.addInstance();
const GPIO7         = GPIO.addInstance();
const GPIO8         = GPIO.addInstance();
const GPIO9         = GPIO.addInstance();
const MATHACL       = scripting.addModule("/ti/driverlib/MATHACL");
const MCAN          = scripting.addModule("/ti/driverlib/MCAN", {}, false);
const MCAN1         = MCAN.addInstance();
const PWM           = scripting.addModule("/ti/driverlib/PWM", {}, false);
const PWM1          = PWM.addInstance();
const SPI           = scripting.addModule("/ti/driverlib/SPI", {}, false);
const SPI1          = SPI.addInstance();
const SYSCTL        = scripting.addModule("/ti/driverlib/SYSCTL");
const SYSTICK       = scripting.addModule("/ti/driverlib/SYSTICK");
const TIMER         = scripting.addModule("/ti/driverlib/TIMER", {}, false);
const TIMER1        = TIMER.addInstance();
const TIMER2        = TIMER.addInstance();
const UART          = scripting.addModule("/ti/driverlib/UART", {}, false);
const UART1         = UART.addInstance();
const UART2         = UART.addInstance();
const VREF          = scripting.addModule("/ti/driverlib/VREF");
const ProjectConfig = scripting.addModule("/ti/project_config/ProjectConfig");

/**
 * Write custom configuration values to the imported modules.
 */
const divider5       = system.clockTree["PLL_CLK1_DIV"];
divider5.divideValue = 4;

const divider6       = system.clockTree["PLL_CLK2X_DIV"];
divider6.divideValue = 4;

const divider7       = system.clockTree["PLL_PDIV"];
divider7.divideValue = 2;

const divider9       = system.clockTree["UDIV"];
divider9.divideValue = 2;

const gate7  = system.clockTree["MFCLKGATE"];
gate7.enable = true;

const gate8  = system.clockTree["MFPCLKGATE"];
gate8.enable = true;

const multiplier2         = system.clockTree["PLL_QDIV"];
multiplier2.multiplyValue = 10;

const mux2       = system.clockTree["CANCLKMUX"];
mux2.inputSelect = "CANCLKMUX_PLLCLK1_OUT";

const mux8       = system.clockTree["HSCLKMUX"];
mux8.inputSelect = "HSCLKMUX_SYSPLL2X";

ADC121.$name                 = "ADC12_0";
ADC121.samplingOperationMode = "sequence";
ADC121.adcMem0vref           = "VREF";
ADC121.sampClkSrc            = "DL_ADC12_CLOCK_ULPCLK";
ADC121.adcMem1chansel        = "DL_ADC12_INPUT_CHAN_1";
ADC121.adcMem1vref           = "VREF";
ADC121.adcMem2chansel        = "DL_ADC12_INPUT_CHAN_2";
ADC121.adcMem2vref           = "VREF";
ADC121.adcMem3chansel        = "DL_ADC12_INPUT_CHAN_3";
ADC121.adcMem3vref           = "VREF";
ADC121.adcMem4vref           = "VREF";
ADC121.sampleTime1           = "10us";
ADC121.enabledDMATriggers    = ["DL_ADC12_DMA_MEM11_RESULT_LOADED","DL_ADC12_DMA_MEM5_RESULT_LOADED"];
ADC121.enableDMA             = false;
ADC121.repeatMode            = true;
ADC121.endAdd                = 6;
ADC121.adcMem4chansel        = "DL_ADC12_INPUT_CHAN_7";
ADC121.adcMem5chansel        = "DL_ADC12_INPUT_CHAN_11";
ADC121.adcMem6chansel        = "DL_ADC12_INPUT_CHAN_15";
ADC121.adcMem6vref           = "VREF";
ADC121.enabledInterrupts     = ["DL_ADC12_INTERRUPT_MEM6_RESULT_LOADED"];
ADC121.adcMem5vref           = "VREF";
ADC121.sampleTime0           = "2us";
ADC121.adcMem0stime          = "DL_ADC12_SAMPLE_TIMER_SOURCE_SCOMP1";
ADC121.adcMem1stime          = "DL_ADC12_SAMPLE_TIMER_SOURCE_SCOMP1";
ADC121.adcMem2stime          = "DL_ADC12_SAMPLE_TIMER_SOURCE_SCOMP1";
ADC121.adcMem3stime          = "DL_ADC12_SAMPLE_TIMER_SOURCE_SCOMP1";
ADC121.adcMem4stime          = "DL_ADC12_SAMPLE_TIMER_SOURCE_SCOMP1";
ADC121.adcMem5stime          = "DL_ADC12_SAMPLE_TIMER_SOURCE_SCOMP1";
ADC121.adcMem6stime          = "DL_ADC12_SAMPLE_TIMER_SOURCE_SCOMP1";
ADC121.adcPin0Config.$name   = "ti_driverlib_gpio_GPIOPinGeneric11";
ADC121.adcPin1Config.$name   = "ti_driverlib_gpio_GPIOPinGeneric12";
ADC121.adcPin2Config.$name   = "ti_driverlib_gpio_GPIOPinGeneric13";
ADC121.adcPin3Config.$name   = "ti_driverlib_gpio_GPIOPinGeneric14";
ADC121.adcPin7Config.$name   = "ti_driverlib_gpio_GPIOPinGeneric19";

const Board = scripting.addModule("/ti/driverlib/Board", {}, false);

COMPARE1.$name                      = "COMPARE_0";
COMPARE1.timerPeriod                = 65535;
COMPARE1.peripheral.$assign         = "TIMG12";
COMPARE1.peripheral.ccp0Pin.$assign = "PA14";
COMPARE1.ccp0PinConfig.$name        = "CC";

COMPARE2.$name                      = "COMPARE_1";
COMPARE2.timerPeriod                = 65535;
COMPARE2.peripheral.$assign         = "TIMG7";
COMPARE2.peripheral.ccp0Pin.$assign = "PB15";
COMPARE2.ccp0PinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric5";

COMPARE3.$name                      = "COMPARE_2";
COMPARE3.timerPeriod                = 65535;
COMPARE3.peripheral.$assign         = "TIMG6";
COMPARE3.peripheral.ccp0Pin.$assign = "PB6";
COMPARE3.ccp0PinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric6";

GPIO1.$name                          = "LED";
GPIO1.associatedPins.create(4);
GPIO1.associatedPins[0].$name        = "LED0";
GPIO1.associatedPins[0].assignedPort = "PORTB";
GPIO1.associatedPins[0].assignedPin  = "0";
GPIO1.associatedPins[0].initialValue = "SET";
GPIO1.associatedPins[0].pin.$assign  = "PB0";
GPIO1.associatedPins[1].assignedPort = "PORTB";
GPIO1.associatedPins[1].assignedPin  = "1";
GPIO1.associatedPins[1].$name        = "LED1";
GPIO1.associatedPins[1].initialValue = "SET";
GPIO1.associatedPins[1].pin.$assign  = "PB1";
GPIO1.associatedPins[2].$name        = "LED2";
GPIO1.associatedPins[2].assignedPort = "PORTB";
GPIO1.associatedPins[2].assignedPin  = "4";
GPIO1.associatedPins[2].initialValue = "SET";
GPIO1.associatedPins[2].pin.$assign  = "PB4";
GPIO1.associatedPins[3].$name        = "LED3";
GPIO1.associatedPins[3].assignedPort = "PORTB";
GPIO1.associatedPins[3].assignedPin  = "5";
GPIO1.associatedPins[3].initialValue = "SET";
GPIO1.associatedPins[3].pin.$assign  = "PB5";

GPIO2.$name                          = "BUZZER";
GPIO2.associatedPins[0].$name        = "BUZZER0";
GPIO2.associatedPins[0].initialValue = "SET";
GPIO2.associatedPins[0].assignedPort = "PORTA";
GPIO2.associatedPins[0].assignedPin  = "16";
GPIO2.associatedPins[0].pin.$assign  = "PA16";

GPIO3.$name                         = "BUTTON";
GPIO3.port                          = "PORTB";
GPIO3.associatedPins.create(8);
GPIO3.associatedPins[0].$name       = "UP";
GPIO3.associatedPins[0].assignedPin = "21";
GPIO3.associatedPins[0].direction   = "INPUT";
GPIO3.associatedPins[0].pin.$assign = "PB21";
GPIO3.associatedPins[1].$name       = "DOWN";
GPIO3.associatedPins[1].assignedPin = "25";
GPIO3.associatedPins[1].direction   = "INPUT";
GPIO3.associatedPins[1].pin.$assign = "PB25";
GPIO3.associatedPins[2].$name       = "LEFT";
GPIO3.associatedPins[2].assignedPin = "27";
GPIO3.associatedPins[2].direction   = "INPUT";
GPIO3.associatedPins[2].pin.$assign = "PB27";
GPIO3.associatedPins[3].$name       = "RIGHT";
GPIO3.associatedPins[3].assignedPin = "22";
GPIO3.associatedPins[3].direction   = "INPUT";
GPIO3.associatedPins[3].pin.$assign = "PB22";
GPIO3.associatedPins[4].$name       = "PREV";
GPIO3.associatedPins[4].assignedPin = "23";
GPIO3.associatedPins[4].direction   = "INPUT";
GPIO3.associatedPins[4].pin.$assign = "PB23";
GPIO3.associatedPins[5].$name       = "NEXT";
GPIO3.associatedPins[5].assignedPin = "24";
GPIO3.associatedPins[5].direction   = "INPUT";
GPIO3.associatedPins[5].pin.$assign = "PB24";
GPIO3.associatedPins[6].$name       = "ENTER";
GPIO3.associatedPins[6].assignedPin = "26";
GPIO3.associatedPins[6].direction   = "INPUT";
GPIO3.associatedPins[6].pin.$assign = "PB26";
GPIO3.associatedPins[7].$name       = "ESC";
GPIO3.associatedPins[7].assignedPin = "20";
GPIO3.associatedPins[7].direction   = "INPUT";
GPIO3.associatedPins[7].pin.$assign = "PB20";

