cptzs/MSPM0G3507_ModelVehicleControl/main.syscfg
GPIO4.$name                          = "OLED";
GPIO4.associatedPins.create(2);
GPIO4.associatedPins[0].$name        = "DC";
GPIO4.associatedPins[0].assignedPort = "PORTA";
GPIO4.associatedPins[0].assignedPin  = "7";
GPIO4.associatedPins[0].pin.$assign  = "PA7";
GPIO4.associatedPins[1].$name        = "NRST";
GPIO4.associatedPins[1].assignedPort = "PORTA";
GPIO4.associatedPins[1].assignedPin  = "10";
GPIO4.associatedPins[1].pin.$assign  = "PA10";

GPIO5.$name                       = "ENCODERA";
GPIO5.port                        = "PORTA";
GPIO5.associatedPins[0].direction = "INPUT";
GPIO5.associatedPins[0].$name     = "DIR0";

GPIO6.$name                         = "ENCODERB";
GPIO6.associatedPins.create(2);
GPIO6.associatedPins[0].direction   = "INPUT";
GPIO6.associatedPins[0].$name       = "DIR1";
GPIO6.associatedPins[0].pin.$assign = "PB18";
GPIO6.associatedPins[1].direction   = "INPUT";
GPIO6.associatedPins[1].$name       = "DIR2";
GPIO6.associatedPins[1].pin.$assign = "PB7";

GPIO7.$name                         = "MOTOR";
GPIO7.port                          = "PORTB";
GPIO7.associatedPins.create(4);
GPIO7.associatedPins[0].$name       = "NSLP_A";
GPIO7.associatedPins[0].pin.$assign = "PB10";
GPIO7.associatedPins[1].$name       = "PH_A";
GPIO7.associatedPins[1].pin.$assign = "PB9";
GPIO7.associatedPins[2].$name       = "NSLP_B";
GPIO7.associatedPins[2].pin.$assign = "PB14";
GPIO7.associatedPins[3].$name       = "PH_B";
GPIO7.associatedPins[3].pin.$assign = "PB13";

GPIO8.$name                         = "SERVO";
GPIO8.associatedPins.create(2);
GPIO8.associatedPins[0].$name       = "SERVO1";
GPIO8.associatedPins[0].pin.$assign = "PB11";
GPIO8.associatedPins[1].$name       = "SERVO2";
GPIO8.associatedPins[1].pin.$assign = "PB19";

GPIO9.$name                          = "OEMT";
GPIO9.associatedPins.create(4);
GPIO9.associatedPins[0].$name        = "EN";
GPIO9.associatedPins[0].assignedPort = "PORTA";
GPIO9.associatedPins[0].assignedPin  = "28";
GPIO9.associatedPins[0].pin.$assign  = "PA28";
GPIO9.associatedPins[1].$name        = "ADDR0";
GPIO9.associatedPins[1].assignedPort = "PORTA";
GPIO9.associatedPins[1].assignedPin  = "31";
GPIO9.associatedPins[1].pin.$assign  = "PA31";
GPIO9.associatedPins[2].$name        = "ADDR1";
GPIO9.associatedPins[2].assignedPort = "PORTA";
GPIO9.associatedPins[2].assignedPin  = "30";
GPIO9.associatedPins[2].pin.$assign  = "PA30";
GPIO9.associatedPins[3].assignedPort = "PORTA";
GPIO9.associatedPins[3].assignedPin  = "29";
GPIO9.associatedPins[3].$name        = "ADDR2";
GPIO9.associatedPins[3].pin.$assign  = "PA29";

MCAN1.$name                    = "MCAN0";
MCAN1.fdMode                   = false;
MCAN1.wkupReqEnable            = true;
MCAN1.autoWkupEnable           = true;
MCAN1.emulationEnable          = true;
MCAN1.enableInterrupt          = true;
MCAN1.desiredDataRate          = 0.5;
MCAN1.txBufElemSize            = "DL_MCAN_ELEM_SIZE_8BYTES";
MCAN1.interruptFlags           = ["DL_MCAN_INTERRUPT_RF0F","DL_MCAN_INTERRUPT_RF0N"];
MCAN1.interruptLine            = ["DL_MCAN_INTR_LINE_NUM_1"];
MCAN1.m0interrupts             = ["DL_MCAN_MSP_INTERRUPT_LINE1"];
MCAN1.interruptLine1Flag       = ["DL_MCAN_INTERRUPT_RF0F","DL_MCAN_INTERRUPT_RF0N"];
MCAN1.peripheral.rxPin.$assign = "PA13";
MCAN1.peripheral.txPin.$assign = "PA12";
MCAN1.txPinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric2";
MCAN1.rxPinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric4";

PWM1.$name                      = "PWM_0";
PWM1.clockPrescale              = 5;
PWM1.enableShadowLoad           = true;
PWM1.pwmMode                    = "EDGE_ALIGN_UP";
PWM1.peripheral.ccp0Pin.$assign = "PB8";
PWM1.peripheral.ccp1Pin.$assign = "PB12";
PWM1.PWM_CHANNEL_0.$name        = "ti_driverlib_pwm_PWMTimerCC0";
PWM1.PWM_CHANNEL_1.$name        = "ti_driverlib_pwm_PWMTimerCC1";
PWM1.ccp0PinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric7";
PWM1.ccp1PinConfig.$name        = "ti_driverlib_gpio_GPIOPinGeneric8";

SPI1.direction                          = "PICO";
SPI1.$name                              = "SPI_1";
SPI1.rxFifoThreshold                    = "DL_SPI_RX_FIFO_LEVEL_ONE_FRAME";
SPI1.enabledDMAEvent2Triggers           = "DL_SPI_DMA_INTERRUPT_TX";
SPI1.txFifoThreshold                    = "DL_SPI_TX_FIFO_LEVEL_ONE_FRAME";
SPI1.targetBitRate                      = 800000;
SPI1.enabledInterrupts                  = ["DMA_DONE_TX"];
SPI1.sclkPinConfig.direction            = scripting.forceWrite("OUTPUT");
SPI1.sclkPinConfig.onlyInternalResistor = scripting.forceWrite(false);
SPI1.sclkPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
SPI1.sclkPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric0";
SPI1.mosiPinConfig.direction            = scripting.forceWrite("OUTPUT");
SPI1.mosiPinConfig.hideOutputInversion  = scripting.forceWrite(false);
SPI1.mosiPinConfig.onlyInternalResistor = scripting.forceWrite(false);
SPI1.mosiPinConfig.passedPeripheralType = scripting.forceWrite("Digital");
SPI1.mosiPinConfig.$name                = "ti_driverlib_gpio_GPIOPinGeneric1";
SPI1.cs0PinConfig.direction             = scripting.forceWrite("OUTPUT");
SPI1.cs0PinConfig.hideOutputInversion   = scripting.forceWrite(false);
SPI1.cs0PinConfig.onlyInternalResistor  = scripting.forceWrite(false);
SPI1.cs0PinConfig.passedPeripheralType  = scripting.forceWrite("Digital");
SPI1.cs0PinConfig.$name                 = "ti_driverlib_gpio_GPIOPinGeneric3";
SPI1.peripheral.$assign                 = "SPI0";
SPI1.peripheral.sclkPin.$assign         = "PA11";
SPI1.peripheral.mosiPin.$assign         = "PA9";
SPI1.peripheral.cs0Pin.$assign          = "PA8";
SPI1.DMA_CHANNEL_EVENT2.addressMode     = "b2f";
SPI1.DMA_CHANNEL_EVENT2.srcLength       = "BYTE";
SPI1.DMA_CHANNEL_EVENT2.dstLength       = "BYTE";
SPI1.DMA_CHANNEL_EVENT2.transferSize    = 8;
SPI1.DMA_CHANNEL_EVENT2.enableInterrupt = true;
SPI1.DMA_CHANNEL_EVENT2.$name           = "DMA_CH_SPI0_TX";

SYSCTL.clockTreeEn = true;

SYSTICK.periodEnable    = true;
SYSTICK.interruptEnable = true;
SYSTICK.period          = 80000;
SYSTICK.systickEnable   = true;

