cptzs/MSPM0G3507_ModelVehicleControl/main.syscfg
TIMER1.interrupts       = ["LOAD"];
TIMER1.$name            = "TIMER_OEMT";
TIMER1.timerMode        = "PERIODIC";
TIMER1.timerClkPrescale = 40;
TIMER1.timerPeriod      = "125us";

TIMER2.$name = "TIMER_SREVO";

UART1.$name                        = "UART_0";
UART1.txFifoThreshold              = "DL_UART_TX_FIFO_LEVEL_1_4_EMPTY";
UART1.targetBaudRate               = 115200;
UART1.enabledInterrupts            = ["DMA_DONE_RX","DMA_DONE_TX","RX","TX"];
UART1.enabledDMARXTriggers         = "DL_UART_DMA_INTERRUPT_RX";
UART1.enabledDMATXTriggers         = "DL_UART_DMA_INTERRUPT_TX";
UART1.peripheral.$assign           = "UART0";
UART1.peripheral.rxPin.$assign     = "PA1";
UART1.peripheral.txPin.$assign     = "PA0";
UART1.txPinConfig.$name            = "ti_driverlib_gpio_GPIOPinGeneric9";
UART1.txPinConfig.internalResistor = "PULL_UP";
UART1.rxPinConfig.$name            = "ti_driverlib_gpio_GPIOPinGeneric10";
UART1.DMA_CHANNEL_RX.srcLength     = "BYTE";
UART1.DMA_CHANNEL_RX.dstLength     = "BYTE";
UART1.DMA_CHANNEL_RX.addressMode   = "f2b";
UART1.DMA_CHANNEL_RX.$name         = "DMA_CH_UART0_RX";
UART1.DMA_CHANNEL_TX.addressMode   = "b2f";
UART1.DMA_CHANNEL_TX.srcLength     = "BYTE";
UART1.DMA_CHANNEL_TX.dstLength     = "BYTE";
UART1.DMA_CHANNEL_TX.$name         = "DMA_CH_UART0_TX";

UART2.$name                      = "UART_1";
UART2.targetBaudRate             = 115200;
UART2.enabledInterrupts          = ["DMA_DONE_RX","DMA_DONE_TX","RX","TX"];
UART2.enabledDMARXTriggers       = "DL_UART_DMA_INTERRUPT_RX";
UART2.enabledDMATXTriggers       = "DL_UART_DMA_INTERRUPT_TX";
UART2.peripheral.rxPin.$assign   = "PB16";
UART2.peripheral.txPin.$assign   = "PB17";
UART2.txPinConfig.$name          = "ti_driverlib_gpio_GPIOPinGeneric17";
UART2.rxPinConfig.$name          = "ti_driverlib_gpio_GPIOPinGeneric18";
UART2.DMA_CHANNEL_RX.$name       = "DMA_CH0";
UART2.DMA_CHANNEL_RX.srcLength   = "BYTE";
UART2.DMA_CHANNEL_RX.dstLength   = "BYTE";
UART2.DMA_CHANNEL_RX.addressMode = "f2b";
UART2.DMA_CHANNEL_TX.$name       = "DMA_CH1";
UART2.DMA_CHANNEL_TX.srcLength   = "BYTE";
UART2.DMA_CHANNEL_TX.dstLength   = "BYTE";
UART2.DMA_CHANNEL_TX.addressMode = "b2f";

VREF.basicMode              = "DL_VREF_ENABLE_DISABLE";
VREF.basicExtVolt           = 3.3;
VREF.basicVrefPins          = "VREF+-";
VREF.vrefPosPinConfig.$name = "ti_driverlib_gpio_GPIOPinGeneric15";
VREF.vrefNegPinConfig.$name = "ti_driverlib_gpio_GPIOPinGeneric16";

ProjectConfig.genLibCMSIS = true;

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
ADC121.peripheral.$suggestSolution                  = "ADC0";
ADC121.peripheral.adcPin0.$suggestSolution          = "PA27";
ADC121.peripheral.adcPin1.$suggestSolution          = "PA26";
ADC121.peripheral.adcPin2.$suggestSolution          = "PA25";
ADC121.peripheral.adcPin3.$suggestSolution          = "PA24";
ADC121.peripheral.adcPin7.$suggestSolution          = "PA22";
Board.peripheral.$suggestSolution                   = "DEBUGSS";
Board.peripheral.swclkPin.$suggestSolution          = "PA20";
Board.peripheral.swdioPin.$suggestSolution          = "PA19";
GPIO5.associatedPins[0].pin.$suggestSolution        = "PA15";
MCAN1.peripheral.$suggestSolution                   = "CANFD0";
PWM1.peripheral.$suggestSolution                    = "TIMA0";
SPI1.DMA_CHANNEL_EVENT2.peripheral.$suggestSolution = "DMA_CH4";
TIMER1.peripheral.$suggestSolution                  = "TIMG0";
TIMER2.peripheral.$suggestSolution                  = "TIMA1";
UART1.DMA_CHANNEL_RX.peripheral.$suggestSolution    = "DMA_CH3";
UART1.DMA_CHANNEL_TX.peripheral.$suggestSolution    = "DMA_CH2";
UART2.peripheral.$suggestSolution                   = "UART2";
UART2.DMA_CHANNEL_RX.peripheral.$suggestSolution    = "DMA_CH1";
UART2.DMA_CHANNEL_TX.peripheral.$suggestSolution    = "DMA_CH0";
VREF.peripheral.$suggestSolution                    = "VREF";
VREF.peripheral.vrefPosPin.$suggestSolution         = "PA23";
VREF.peripheral.vrefNegPin.$suggestSolution         = "PA21";
